src/cf/DataProcessors/ПечатьЧека.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПечатьЧека</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСоСкидками</Name>
							<Comment>Цена со скидками</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакСпособаРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПризнакиСпособаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакПредметаРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАгента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПризнакиАгента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ПризнакиАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПризнакиАгента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БанковскийПлатежныйАгент</Name>
					<Comment>Оказание услуг покупателю (клиенту) пользователем, являющимся банковским платежным агентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийПлатежныйСубагент</Name>
					<Comment>Оказание услуг покупателю (клиенту) пользователем, являющимся банковским платежным субагентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйАгент</Name>
					<Comment>Оказание услуг покупателю (клиенту) пользователем, являющимся платежным агентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежныйСубагент</Name>
					<Comment>Оказание услуг покупателю (клиенту) пользователем, являющимся платежным субагентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поверенный</Name>
					<Comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся поверенным</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комиссионер</Name>
					<Comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся комиссионером</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
					<Comment>Осуществление расчета с покупателем (клиентом) пользователем, являющимся агентом и не являющимся банковским платежным агентом (субагентом), платежным агентом (субагентом), поверенным, комиссионером</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/ПечатьЧека/Forms/РеквизитыАгента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодготовитьФормуНаСервере();
	
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ИННПоставщика) Тогда
		РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(ИННПоставщика, Истина);
		Если НЕ РезультатПроверки.СоответствуетТребованиям Тогда
			Если ЭтоПоставщик(ПризнакАгента) Тогда
				ПредставлениеПоля = "ИНН комитента";
			ИначеЕсли ЭтоБанковскийАгент(ПризнакАгента) Тогда 
				ПредставлениеПоля = "ИНН получателя средств";
			Иначе
				ПредставлениеПоля = "ИНН поставщика";
			КонецЕсли;
			
			ТекстСообщенияПользователю = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Корректность", ПредставлениеПоля,,,РезультатПроверки.ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю,,"ИННПоставщика", , Отказ);
		КонецЕсли; 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ИННОператораПеревода) Тогда
		РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(ИННОператораПеревода, Истина);
		Если НЕ РезультатПроверки.СоответствуетТребованиям Тогда
			ТекстСообщенияПользователю = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Корректность", "ИНН оператора перевода",,,РезультатПроверки.ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю,,"ИННОператораПеревода", , Отказ);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПризнакАгентаПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СобственныеТоварыУслуги1ПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СобственныеТоварыУслуги0ПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КомандаОК(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПризнакАгента",    ПризнакАгента);
	
	Если СобственныеТоварыУслуги = 0 Тогда
		Если ЭтоБанковскийАгент(ПризнакАгента) ИЛИ ЭтоПлатежныйАгент(ПризнакАгента) Тогда
			// Заполняем данные агента
			ДанныеАгента = МенеджерОборудованияКлиентСервер.ПараметрыДанныеАгента();
			
			ДанныеАгента.ОператорПеревода.ИНН             = ИННОператораПеревода;
			ДанныеАгента.ОператорПеревода.Наименование    = НаименованиеОператораПеревода;
			ДанныеАгента.ОператорПеревода.Адрес           = АдресОператораПеревода;
			ДанныеАгента.ОператорПеревода.Телефон         = ТелефонОператораПеревода;
			
			ДанныеАгента.ПлатежныйАгент.Операция          = ОперацияПлатежногоАгента;
			ДанныеАгента.ПлатежныйАгент.Телефон           = ТелефонПлатежногоАгента;
			
			ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = ТелефонОператораПоПриемуПлатежей ;
			
			Результат.Вставить("ДанныеАгента",     ДанныеАгента);
		КонецЕсли;
		
		// Заполняем данные поставщика
		ДанныеПоставшика = МенеджерОборудованияКлиентСервер.ПараметрыДанныеПоставщика();
		
		ДанныеПоставшика.ИНН = ИННПоставщика;
		ДанныеПоставшика.Наименование = НаименованиеПоставщика;
		ДанныеПоставшика.Телефон = ТелефонПоставщика;
		
		Результат.Вставить("ДанныеПоставщика", ДанныеПоставшика);
	КонецЕсли; 
	
	Закрыть(Результат);
КонецПроцедуры
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПодготовитьФормуНаСервере()
	Перем ДанныеАгента, ДанныеПоставщика;
	
	ПризнакАгента = Параметры.ПризнакАгента;
	
	СобственныеТоварыУслуги = ?(ЗначениеЗаполнено(ПризнакАгента), 0, 1);
	
	Если Параметры.Свойство("ДанныеАгента", ДанныеАгента) Тогда
		ИННОператораПеревода             = ДанныеАгента.ОператорПеревода.ИНН;
		НаименованиеОператораПеревода    = ДанныеАгента.ОператорПеревода.Наименование;
		АдресОператораПеревода           = ДанныеАгента.ОператорПеревода.Адрес;
		ТелефонОператораПеревода         = ДанныеАгента.ОператорПеревода.Телефон;
		
		ОперацияПлатежногоАгента         = ДанныеАгента.ПлатежныйАгент.Операция;
		ТелефонПлатежногоАгента          = ДанныеАгента.ПлатежныйАгент.Телефон;
		
		ТелефонОператораПоПриемуПлатежей = ДанныеАгента.ОператорПоПриемуПлатежей.Телефон;
	КонецЕсли;
	
	Если Параметры.Свойство("ДанныеПоставщика", ДанныеПоставщика) Тогда
		ИННПоставщика                    = ДанныеПоставщика.ИНН;
		НаименованиеПоставщика           = ДанныеПоставщика.Наименование;
		ТелефонПоставщика                = ДанныеПоставщика.Телефон;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПоставщик(ПризнакАгента)
	ПризнакиПоставщика = Новый Массив;
	ПризнакиПоставщика.Добавить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Комиссионер"));
	ПризнакиПоставщика.Добавить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Агент"));
	ПризнакиПоставщика.Добавить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Поверенный"));
	
	Возврат (ПризнакиПоставщика.Найти(ПризнакАгента) <> Неопределено);
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПлатежныйАгент(ПризнакАгента)
	ПризнакиПлатежныйАгент = Новый Массив;
	ПризнакиПлатежныйАгент.Добавить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.ПлатежныйАгент"));
	ПризнакиПлатежныйАгент.Добавить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.ПлатежныйСубАгент"));
	
	Возврат (ПризнакиПлатежныйАгент.Найти(ПризнакАгента) <> Неопределено);
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоБанковскийАгент(ПризнакАгента)
	ПризнакиБанковскийАгент = Новый Массив;
	ПризнакиБанковскийАгент.Добавить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.БанковскийПлатежныйАгент"));
	ПризнакиБанковскийАгент.Добавить(ПредопределенноеЗначение("Перечисление.ПризнакиАгента.БанковскийПлатежныйСубагент"));
	
	Возврат (ПризнакиБанковскийАгент.Найти(ПризнакАгента) <> Неопределено);
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаРеквизитыПоставщика.Видимость        = (Форма.СобственныеТоварыУслуги = 0) И ЭтоПоставщик(Форма.ПризнакАгента);
	Элементы.ГруппаРеквизитыПлатежногоАгента.Видимость  = (Форма.СобственныеТоварыУслуги = 0) И ЭтоПлатежныйАгент(Форма.ПризнакАгента);
	Элементы.ГруппаРеквизитыБанковскогоАгента.Видимость = (Форма.СобственныеТоварыУслуги = 0) И ЭтоБанковскийАгент(Форма.ПризнакАгента);
	
	Если Форма.ПризнакАгента = ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Комиссионер") Тогда
		Элементы.ГруппаРеквизиты.Заголовок = НСтр("ru = 'Реквизиты комитента'");
	ИначеЕсли Форма.ПризнакАгента = ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Агент") Тогда
		Элементы.ГруппаРеквизиты.Заголовок = НСтр("ru = 'Реквизиты принципала'");
	ИначеЕсли Форма.ПризнакАгента = ПредопределенноеЗначение("Перечисление.ПризнакиАгента.Поверенный") Тогда
		Элементы.ГруппаРеквизиты.Заголовок = НСтр("ru = 'Реквизиты доверителя'");
	КонецЕсли;
	
	Элементы.ПризнакАгента.Доступность = (Форма.СобственныеТоварыУслуги = 0);
КонецПроцедуры
#КонецОбласти
